{ pkgs, lib, config, ... }:
{
  # Import nixos modules & configs for all systems here!
  imports = [ ];

/*  ////////////////////////////////////////////////////////////////////////
    //                                                                    //
    //                                                                    //
    //     ███████████ █████                                              //
    //    ░█░░░███░░░█░░███                                               //
    //    ░   ░███  ░  ░███████    ██████                                 //
    //        ░███     ░███░░███  ███░░███                                //
    //        ░███     ░███ ░███ ░███████                                 //
    //        ░███     ░███ ░███ ░███░░░                                  //
    //        █████    ████ █████░░██████                                 //
    //       ░░░░░    ░░░░ ░░░░░  ░░░░░░                                  //
    //                                                                    //
    //                                                                    //
    //                                                                    //
    //     █████   █████                           ███                    //
    //    ░░███   ░░███                           ░░░                     //
    //     ░███    ░███   ██████  █████████████   ████   ██████           //
    //     ░███████████  ███░░███░░███░░███░░███ ░░███  ███░░███          //
    //     ░███░░░░░███ ░███ ░███ ░███ ░███ ░███  ░███ ░███████           //
    //     ░███    ░███ ░███ ░███ ░███ ░███ ░███  ░███ ░███░░░            //
    //     █████   █████░░██████  █████░███ █████ █████░░██████           //
    //    ░░░░░   ░░░░░  ░░░░░░  ░░░░░ ░░░ ░░░░░ ░░░░░  ░░░░░░            //
    //                                                                    //
    //                                                                    //
    //                                                                    //
    //       █████████                         ██████   ███               //
    //      ███░░░░░███                       ███░░███ ░░░                //
    //     ███     ░░░   ██████  ████████    ░███ ░░░  ████   ███████     //
    //    ░███          ███░░███░░███░░███  ███████   ░░███  ███░░███     //
    //    ░███         ░███ ░███ ░███ ░███ ░░░███░     ░███ ░███ ░███     //
    //    ░░███     ███░███ ░███ ░███ ░███   ░███      ░███ ░███ ░███     //
    //     ░░█████████ ░░██████  ████ █████  █████     █████░░███████     //
    //      ░░░░░░░░░   ░░░░░░  ░░░░ ░░░░░  ░░░░░     ░░░░░  ░░░░░███     //
    //                                                       ███ ░███     //
    //                                                      ░░██████      //
    //                                                       ░░░░░░       //
    //                                                                    //
    //                                                                    //
    ////////////////////////////////////////////////////////////////////////  */

  # Bootloader
  boot.loader.systemd-boot.enable = true;
  boot.loader.efi.canTouchEfiVariables = true;

  # Networking
  networking.firewall.enable = true;
  networking.networkmanager.enable = true;

  # Time & Localization
  time.timeZone = "America/Denver";
  i18n.defaultLocale = "en_US.UTF-8";

  # User
  users.users.erik = {
    isNormalUser = true;
    description = "erik";
    extraGroups = [ "wheel" "networkmanager" ];
    packages = with pkgs; [];
  };

  # Packages & Programs Installed onto ALL Systems
  environment.systemPackages = with pkgs; [ btop ];

  # CPU & GPU 
  hardware.cpu.amd.updateMicrocode = 
    lib.mkDefault config.hardware.enableRedistributableFirmware;

  hardware.amdgpu.initrd.enable = lib.mkDefault true;

  # Nix
  nix = {
    settings = {
      download-buffer-size = 524288000; # 500 MiB
      auto-optimise-store = true; # This saves disk space by removing identical symlinks from the nix-store
    
      experimental-features = [ "nix-command" "flakes" ]; # Enables flakes!
      warn-dirty = false;                                 # Blocks annoying flake warning
    };

    gc = {
      automatic = true; # Automatically run nix-garbage-collect at a specific time
      dates = "weekly";
      options = "--delete-older-than 14d"; # Deletes nixos generations older than 14 days
    };
  };

  nixpkgs.config.allowUnfree = true;
}
